app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."todo_id" = ?  [["todo_id", 1]]
---
  def set_todo_item
    @item = @todo.items.find_by!(id: params[:id]) if @todo