app/controllers/todos_controller.rb

INSERT INTO "todos" ("title", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Learn Elm"], ["created_by", "1"], ["created_at", 2017-03-30 17:45:16 UTC], ["updated_at", 2017-03-30 17:45:16 UTC]]
---
  def create
    @todo = Todo.create!(todo_params)